#### `terragrunt run-all plan` Success
<details><summary>Show Output</summary>

```


No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.env: Refreshing state... [id=folders/978739234566]
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_project.env: Refreshing state... [id=projects/bon-transport-prd-07]
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_project_service.api["logging"]: Refreshing state... [id=bon-transport-prd-07/logging.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-transport-prd-07/compute.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-transport-prd-07/storage-api.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-transport-prd-07/cloudresourcemanager.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-transport-prd-07/serviceusage.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-transport-prd-07/dns.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-transport-prd-07/iam.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-transport-prd-07/cloudbilling.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-transport-prd-07/monitoring.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-transport-prd-07/iamcredentials.googleapis.com]
google_folder.env: Refreshing state... [id=folders/512817110928]
google_folder.env: Refreshing state... [id=folders/605914450685]
google_folder.this: Refreshing state... [id=folders/692745425625]
google_folder.this: Refreshing state... [id=folders/430824589187]
google_folder.this: Refreshing state... [id=folders/34959545008]
google_project.env: Refreshing state... [id=projects/bon-transport-stg-07]
google_project.env: Refreshing state... [id=projects/bon-transport-dev-07]



No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-transport-dev-07/global/networks/transport-dev]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-transport-stg-07/global/networks/transport-stg]
google_compute_ha_vpn_gateway.this: Refreshing state... [id=projects/bon-transport-dev-07/regions/us-central1/vpnGateways/transport-dev]
google_compute_router.this: Refreshing state... [id=projects/bon-transport-dev-07/regions/us-central1/routers/transport-dev]
google_compute_router.this: Refreshing state... [id=projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg]
google_compute_ha_vpn_gateway.this: Refreshing state... [id=projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg]


No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.env: Refreshing state... [id=folders/97394106663]
google_folder.projects: Refreshing state... [id=folders/435506212668]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-b-prd-07]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-b-prd-07/monitoring.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-b-prd-07/stackdriver.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-b-prd-07/iamcredentials.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-b-prd-07/dns.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-b-prd-07/iam.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-b-prd-07/logging.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-b-prd-07/serviceusage.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-b-prd-07/compute.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-b-prd-07/storage-api.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-b-prd-07/cloudbilling.googleapis.com]
google_folder.env: Refreshing state... [id=folders/575000724624]
google_folder.env: Refreshing state... [id=folders/651638536948]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-a-prd-07]
google_folder.projects: Refreshing state... [id=folders/778949376853]
google_folder.projects: Refreshing state... [id=folders/75950899404]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-c-prd-07]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-a-prd-07/cloudresourcemanager.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-a-prd-07/storage-api.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-a-prd-07/stackdriver.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-a-prd-07/dns.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-a-prd-07/monitoring.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-a-prd-07/logging.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-a-prd-07/cloudbilling.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-a-prd-07/compute.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-a-prd-07/iam.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-a-prd-07/iamcredentials.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-c-prd-07/compute.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-c-prd-07/serviceusage.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-c-prd-07/storage-api.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-c-prd-07/iamcredentials.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-c-prd-07/dns.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-c-prd-07/iam.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-c-prd-07/stackdriver.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-c-prd-07/cloudbilling.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-c-prd-07/cloudresourcemanager.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-c-prd-07/logging.googleapis.com]
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.env: Refreshing state... [id=folders/999576914705]
google_folder.env: Refreshing state... [id=folders/354041018976]
google_folder.env: Refreshing state... [id=folders/150578772375]
google_folder.env: Refreshing state... [id=folders/684816684596]
google_folder.env: Refreshing state... [id=folders/889070619480]
google_folder.env: Refreshing state... [id=folders/923684453635]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-b-prd-07/cloudresourcemanager.googleapis.com]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-b-dev-07]
google_folder.projects: Refreshing state... [id=folders/239339018442]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-a-stg-07]
google_folder.projects: Refreshing state... [id=folders/452810046894]
google_folder.projects: Refreshing state... [id=folders/366493767935]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-b-stg-07]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-c-dev-07]
google_folder.projects: Refreshing state... [id=folders/755901542890]
google_folder.projects: Refreshing state... [id=folders/487920024190]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-c-stg-07]
google_project.env: Refreshing state... [id=projects/bon-dept-squad-a-dev-07]
google_folder.projects: Refreshing state... [id=folders/484336764183]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-b-dev-07/monitoring.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-b-dev-07/logging.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-b-dev-07/dns.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-b-dev-07/compute.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-b-dev-07/cloudbilling.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-b-dev-07/iam.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-b-dev-07/storage-api.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-b-dev-07/cloudresourcemanager.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-b-dev-07/stackdriver.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-b-dev-07/iamcredentials.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-c-stg-07/dns.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-c-stg-07/stackdriver.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-c-stg-07/storage-api.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-c-stg-07/compute.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-c-stg-07/cloudresourcemanager.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-c-stg-07/iamcredentials.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-c-stg-07/logging.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-c-stg-07/serviceusage.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-c-stg-07/cloudbilling.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-c-stg-07/monitoring.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-a-dev-07/cloudbilling.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-a-dev-07/cloudresourcemanager.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-a-dev-07/logging.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-a-dev-07/stackdriver.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-a-dev-07/iam.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-a-dev-07/compute.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-a-dev-07/monitoring.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-a-dev-07/serviceusage.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-a-dev-07/iamcredentials.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-a-dev-07/storage-api.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-b-stg-07/cloudbilling.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-b-stg-07/compute.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-b-stg-07/logging.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-b-stg-07/monitoring.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-b-stg-07/iamcredentials.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-b-stg-07/serviceusage.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-b-stg-07/storage-api.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-b-stg-07/cloudresourcemanager.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-b-stg-07/dns.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-b-stg-07/stackdriver.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-a-stg-07/serviceusage.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-a-stg-07/storage-api.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-a-stg-07/iam.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-a-stg-07/monitoring.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-a-stg-07/logging.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-a-stg-07/dns.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-a-stg-07/iamcredentials.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-a-stg-07/cloudbilling.googleapis.com]
google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-a-stg-07/compute.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-a-stg-07/stackdriver.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-c-dev-07/serviceusage.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-c-dev-07/monitoring.googleapis.com]
google_project_service.api["storage-api"]: Refreshing state... [id=bon-dept-squad-c-dev-07/storage-api.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-dept-squad-c-dev-07/logging.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-dept-squad-c-dev-07/iamcredentials.googleapis.com]
google_project_service.api["cloudresourcemanager"]: Refreshing state... [id=bon-dept-squad-c-dev-07/cloudresourcemanager.googleapis.com]
google_project_service.api["cloudbilling"]: Refreshing state... [id=bon-dept-squad-c-dev-07/cloudbilling.googleapis.com]
google_project_service.api["dns"]: Refreshing state... [id=bon-dept-squad-c-dev-07/dns.googleapis.com]
google_project_service.api["stackdriver"]: Refreshing state... [id=bon-dept-squad-c-dev-07/stackdriver.googleapis.com]
google_project_service.api["iam"]: Refreshing state... [id=bon-dept-squad-c-dev-07/iam.googleapis.com]
google_project_service.api["serviceusage"]: Refreshing state... [id=bon-dept-squad-a-prd-07/serviceusage.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-dept-squad-c-prd-07/monitoring.googleapis.com]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-b-prd-07/global/networks/dept-squad-b-prd]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-b-prd-07]


Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

google_project_service.api["compute"]: Refreshing state... [id=bon-dept-squad-c-dev-07/compute.googleapis.com]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-a-prd-07/global/networks/dept-squad-a-prd]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-c-prd-07/global/networks/dept-squad-c-prd]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-c-prd-07]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-a-prd-07]


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "dept-squad-a-prd"
      + network        = "dept-squad-a-prd"
      + project        = "bon-dept-squad-a-prd-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

      + id                 = (known after apply)
      + name               = "dept-squad-a-prd"
      + network            = "dept-squad-a-prd"
      + project            = "bon-dept-squad-a-prd-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64524

          + advertised_ip_ranges {
  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "dept-squad-c-prd"
      + network        = "dept-squad-c-prd"
      + project        = "bon-dept-squad-c-prd-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dept-squad-c-prd"
      + network            = "dept-squad-c-prd"
      + project            = "bon-dept-squad-c-prd-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64544

          + advertised_ip_ranges {
              + range = "10.0.11.0/24"
            }
        }
    }

  # google_compute_router_interface.squad0 will be created
  + resource "google_compute_router_interface" "squad0" {
      + id         = (known after apply)
      + ip_range   = "169.254.44.2/30"
      + name       = "transport-prd-iface0"
      + project    = "bon-dept-squad-c-prd-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-prd-tun0"
    }

  # google_compute_router_interface.squad1 will be created
  + resource "google_compute_router_interface" "squad1" {
      + id         = (known after apply)
      + ip_range   = "169.254.44.6/30"
      + name       = "transport-prd-iface1"
      + project    = "bon-dept-squad-c-prd-07"
              + range = "10.0.9.0/24"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-prd-tun1"
    }

  # google_compute_router_interface.transport0 will be created
  + resource "google_compute_router_interface" "transport0" {
      + id         = (known after apply)
      + ip_range   = "169.254.44.1/30"
      + name       = "dept-squad-c-prd-iface0"
      + project    = "bon-transport-prd-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
      + vpn_tunnel = "dept-squad-c-prd-tun0"
    }

            }
        }
    }

  # google_compute_router_interface.squad0 will be created
  + resource "google_compute_router_interface" "squad0" {
      + id         = (known after apply)
      + ip_range   = "169.254.24.2/30"
      + name       = "transport-prd-iface0"
      + project    = "bon-dept-squad-a-prd-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-prd-tun0"
    }

  # google_compute_router_interface.squad1 will be created
  + resource "google_compute_router_interface" "squad1" {
      + id         = (known after apply)
      + ip_range   = "169.254.24.6/30"
      + name       = "transport-prd-iface1"
      + project    = "bon-dept-squad-a-prd-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-prd-tun1"
    }

  # google_compute_router_interface.transport0 will be created
  + resource "google_compute_router_interface" "transport0" {
      + id         = (known after apply)
  # google_compute_router_interface.transport1 will be created
      + ip_range   = "169.254.24.1/30"
      + name       = "dept-squad-a-prd-iface0"
  + resource "google_compute_router_interface" "transport1" {
      + project    = "bon-transport-prd-07"
      + region     = (known after apply)
      + id         = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
      + vpn_tunnel = "dept-squad-a-prd-tun0"
      + ip_range   = "169.254.44.5/30"
      + name       = "dept-squad-c-prd-iface1"
      + project    = "bon-transport-prd-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
      + vpn_tunnel = "dept-squad-c-prd-tun1"
    }

  # google_compute_router_peer.squad_transport0 will be created
  + resource "google_compute_router_peer" "squad_transport0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
    }

  # google_compute_router_interface.transport1 will be created
  + resource "google_compute_router_interface" "transport1" {
      + id         = (known after apply)
      + ip_range   = "169.254.24.5/30"
      + name       = "dept-squad-a-prd-iface1"
      + project    = "bon-transport-prd-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
      + vpn_tunnel = "dept-squad-a-prd-tun1"
    }

  # google_compute_router_peer.squad_transport0 will be created
  + resource "google_compute_router_peer" "squad_transport0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-a-prd-iface0"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-prd-iface0"
      + peer_asn                  = 64524
      + peer_ip_address           = "169.254.24.2"
      + project                   = "bon-dept-squad-a-prd-07"
      + region                    = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.squad_transport1 will be created
  + resource "google_compute_router_peer" "squad_transport1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-a-prd-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-prd-iface1"
      + peer_asn                  = 64524
      + peer_ip_address           = "169.254.24.6"
      + project                   = "bon-dept-squad-a-prd-07"
      + region                    = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.transport_squad0 will be created
  + resource "google_compute_router_peer" "transport_squad0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-prd-iface0"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-a-prd-iface0"
      + peer_asn                  = 64514
      + peer_ip_address           = "169.254.24.1"
      + project                   = "bon-transport-prd-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
    }

  # google_compute_router_peer.transport_squad1 will be created
  + resource "google_compute_router_peer" "transport_squad1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-prd-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-a-prd-iface1"
      + peer_asn                  = 64514
      + peer_ip_address           = "169.254.24.5"
      + project                   = "bon-transport-prd-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
    }

  # google_compute_vpn_tunnel.squad0 will be created
  + resource "google_compute_vpn_tunnel" "squad0" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-prd-tun0"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/vpnGateways/transport-prd"
      + peer_ip                 = (known after apply)
      + project                 = "bon-dept-squad-a-prd-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + id                        = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = (known after apply)
      + vpn_gateway_interface   = 0
    }

      + interface                 = "dept-squad-c-prd-iface0"
  # google_compute_vpn_tunnel.squad1 will be created
  + resource "google_compute_vpn_tunnel" "squad1" {
      + creation_timestamp      = (known after apply)
      + ip_address                = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-prd-iface0"
      + peer_asn                  = 64544
      + ike_version             = 2
      + peer_ip_address           = "169.254.44.2"
      + project                   = "bon-dept-squad-c-prd-07"
      + region                    = (known after apply)
      + local_traffic_selector  = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.squad_transport1 will be created
      + name                    = "transport-prd-tun1"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/vpnGateways/transport-prd"
      + peer_ip                 = (known after apply)
  + resource "google_compute_router_peer" "squad_transport1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-c-prd-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-prd-iface1"
      + peer_asn                  = 64544
      + peer_ip_address           = "169.254.44.6"
      + project                   = "bon-dept-squad-c-prd-07"
      + region                    = (known after apply)
      + project                 = "bon-dept-squad-a-prd-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = (known after apply)
      + router                    = (known after apply)
      + vpn_gateway_interface   = 0
    }

    }

  # google_compute_vpn_tunnel.transport0 will be created
  + resource "google_compute_vpn_tunnel" "transport0" {
  # google_compute_router_peer.transport_squad0 will be created
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
  + resource "google_compute_router_peer" "transport_squad0" {
      + advertise_mode            = "DEFAULT"
      + id                      = (known after apply)
      + advertised_route_priority = 100
      + ike_version             = 2
      + id                        = (known after apply)
      + local_traffic_selector  = (known after apply)
      + name                    = "dept-squad-a-prd-tun0"
      + interface                 = "transport-prd-iface0"
      + peer_gcp_gateway        = (known after apply)
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-c-prd-iface0"
      + peer_asn                  = 64514
      + peer_ip_address           = "169.254.44.1"
      + project                   = "bon-transport-prd-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
    }

  # google_compute_router_peer.transport_squad1 will be created
  + resource "google_compute_router_peer" "transport_squad1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-prd-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-c-prd-iface1"
      + peer_asn                  = 64514
      + peer_ip_address           = "169.254.44.5"
      + project                   = "bon-transport-prd-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
    }

  # google_compute_vpn_tunnel.squad0 will be created
  + resource "google_compute_vpn_tunnel" "squad0" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-prd-tun0"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/vpnGateways/transport-prd"
      + peer_ip                 = (known after apply)
      + project                 = "bon-dept-squad-c-prd-07"
      + region                  = (known after apply)
      + peer_ip                 = (known after apply)
      + project                 = "bon-transport-prd-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/vpnGateways/transport-prd"
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.transport1 will be created
      + remote_traffic_selector = (known after apply)
  + resource "google_compute_vpn_tunnel" "transport1" {
      + router                  = (known after apply)
      + creation_timestamp      = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + detailed_status         = (known after apply)
      + shared_secret_hash      = (known after apply)
      + id                      = (known after apply)
      + tunnel_id               = (known after apply)
      + ike_version             = 2
      + vpn_gateway             = (known after apply)
      + vpn_gateway_interface   = 0
      + local_traffic_selector  = (known after apply)
    }

  # google_compute_vpn_tunnel.squad1 will be created
      + name                    = "dept-squad-a-prd-tun1"
  + resource "google_compute_vpn_tunnel" "squad1" {
      + peer_gcp_gateway        = (known after apply)
      + creation_timestamp      = (known after apply)
      + peer_ip                 = (known after apply)
      + detailed_status         = (known after apply)
      + project                 = "bon-transport-prd-07"
      + id                      = (known after apply)
      + region                  = (known after apply)
      + ike_version             = 2
      + remote_traffic_selector = (known after apply)
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-prd-tun1"
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/routers/transport-prd"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/vpnGateways/transport-prd"
      + self_link               = (known after apply)
      + peer_ip                 = (known after apply)
      + shared_secret           = (sensitive value)
      + project                 = "bon-dept-squad-c-prd-07"
      + shared_secret_hash      = (known after apply)
      + region                  = (known after apply)
      + tunnel_id               = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-prd-07/regions/us-central1/vpnGateways/transport-prd"
      + vpn_gateway_interface   = 0
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

      + self_link               = (known after apply)
  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
      + shared_secret           = (sensitive value)
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

      + shared_secret_hash      = (known after apply)
Terraform 0.11 and earlier required all non-constant expressions to be
      + tunnel_id               = (known after apply)
provided via interpolation syntax, but this pattern is now deprecated. To
      + vpn_gateway             = (known after apply)
silence this warning, remove the "${ sequence from the start and the }"
      + vpn_gateway_interface   = 0
    }

sequence from the end of this expression, leaving just the inner expression.

  # google_compute_vpn_tunnel.transport0 will be created
Template interpolation syntax is still used to construct strings from
  + resource "google_compute_vpn_tunnel" "transport0" {
expressions when the template includes multiple interpolation sequences or a
      + creation_timestamp      = (known after apply)
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


      + detailed_status         = (known after apply)
      + id                      = (known after apply)

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-a-dev-07/global/networks/dept-squad-a-dev]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-c-stg-07/global/networks/dept-squad-c-stg]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-b-dev-07/global/networks/dept-squad-b-dev]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-a-stg-07/global/networks/dept-squad-a-stg]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-b-stg-07/global/networks/dept-squad-b-stg]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-a-dev-07]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-c-stg-07]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-dept-squad-c-dev-07/global/networks/dept-squad-c-dev]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-b-dev-07]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-a-stg-07]
module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-b-stg-07]

module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0]: Refreshing state... [id=bon-dept-squad-c-dev-07]



An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "dept-squad-c-stg"
      + network        = "dept-squad-c-stg"
      + project        = "bon-dept-squad-c-stg-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dept-squad-c-stg"
      + network            = "dept-squad-c-stg"
      + project            = "bon-dept-squad-c-stg-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64543

          + advertised_ip_ranges {
              + range = "10.0.7.0/24"
            }
        }
    }

  # google_compute_router_interface.squad0 will be created
  + resource "google_compute_router_interface" "squad0" {
      + id         = (known after apply)
      + ip_range   = "169.254.43.2/30"
      + name       = "transport-stg-iface0"
      + project    = "bon-dept-squad-c-stg-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-stg-tun0"
    }

  # google_compute_router_interface.squad1 will be created
  + resource "google_compute_router_interface" "squad1" {
      + id         = (known after apply)
      + ip_range   = "169.254.43.6/30"
      + name       = "transport-stg-iface1"
      + project    = "bon-dept-squad-c-stg-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-stg-tun1"
    }

  # google_compute_router_interface.transport0 will be created
  + resource "google_compute_router_interface" "transport0" {
      + id         = (known after apply)
      + ip_range   = "169.254.43.1/30"
      + name       = "dept-squad-c-stg-iface0"
      + project    = "bon-transport-stg-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + vpn_tunnel = "dept-squad-c-stg-tun0"
    }

  # google_compute_router_interface.transport1 will be created
  + resource "google_compute_router_interface" "transport1" {
      + id         = (known after apply)
      + ip_range   = "169.254.43.5/30"
      + name       = "dept-squad-c-stg-iface1"
      + project    = "bon-transport-stg-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + vpn_tunnel = "dept-squad-c-stg-tun1"
    }

  # google_compute_router_peer.squad_transport0 will be created
  + resource "google_compute_router_peer" "squad_transport0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-c-stg-iface0"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-stg-iface0"
      + peer_asn                  = 64543
      + peer_ip_address           = "169.254.43.2"
      + project                   = "bon-dept-squad-c-stg-07"
      + region                    = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.squad_transport1 will be created
  + resource "google_compute_router_peer" "squad_transport1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-c-stg-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-stg-iface1"
      + peer_asn                  = 64543
      + peer_ip_address           = "169.254.43.6"
      + project                   = "bon-dept-squad-c-stg-07"
      + region                    = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.transport_squad0 will be created
  + resource "google_compute_router_peer" "transport_squad0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-stg-iface0"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-c-stg-iface0"
      + peer_asn                  = 64513
      + peer_ip_address           = "169.254.43.1"
      + project                   = "bon-transport-stg-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
    }

  # google_compute_router_peer.transport_squad1 will be created
  + resource "google_compute_router_peer" "transport_squad1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-stg-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-c-stg-iface1"
      + peer_asn                  = 64513
      + peer_ip_address           = "169.254.43.5"
      + project                   = "bon-transport-stg-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
    }

  # google_compute_vpn_tunnel.squad0 will be created
  + resource "google_compute_vpn_tunnel" "squad0" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-stg-tun0"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + peer_ip                 = (known after apply)
      + project                 = "bon-dept-squad-c-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = (known after apply)
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.squad1 will be created
  + resource "google_compute_vpn_tunnel" "squad1" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-stg-tun1"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + peer_ip                 = (known after apply)
      + project                 = "bon-dept-squad-c-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = (known after apply)
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.transport0 will be created
  + resource "google_compute_vpn_tunnel" "transport0" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "dept-squad-c-stg-tun0"
      + peer_gcp_gateway        = (known after apply)
      + peer_ip                 = (known after apply)
      + project                 = "bon-transport-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.transport1 will be created
  + resource "google_compute_vpn_tunnel" "transport1" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "dept-squad-c-stg-tun1"
      + peer_gcp_gateway        = (known after apply)
      + peer_ip                 = (known after apply)
      + project                 = "bon-transport-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + vpn_gateway_interface   = 0
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


  # google_compute_vpn_tunnel.transport1 will be created
  + resource "google_compute_vpn_tunnel" "transport1" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "dept-squad-a-stg-tun1"
      + peer_gcp_gateway        = (known after apply)
      + peer_ip                 = (known after apply)
      + project                 = "bon-transport-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + vpn_gateway_interface   = 0
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "dept-squad-b-stg"
      + network        = "dept-squad-b-stg"
      + project        = "bon-dept-squad-b-stg-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dept-squad-b-stg"
      + network            = "dept-squad-b-stg"
      + project            = "bon-dept-squad-b-stg-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64533

          + advertised_ip_ranges {
              + range = "10.0.6.0/24"
            }
        }
    }

  # google_compute_router_interface.squad0 will be created
  + resource "google_compute_router_interface" "squad0" {
      + id         = (known after apply)
      + ip_range   = "169.254.33.2/30"
      + name       = "transport-stg-iface0"
      + project    = "bon-dept-squad-b-stg-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-stg-tun0"
    }

  # google_compute_router_interface.squad1 will be created
  + resource "google_compute_router_interface" "squad1" {
      + id         = (known after apply)
      + ip_range   = "169.254.33.6/30"
      + name       = "transport-stg-iface1"
      + project    = "bon-dept-squad-b-stg-07"
      + region     = (known after apply)
      + router     = (known after apply)
      + vpn_tunnel = "transport-stg-tun1"
    }

  # google_compute_router_interface.transport0 will be created
  + resource "google_compute_router_interface" "transport0" {
      + id         = (known after apply)
      + ip_range   = "169.254.33.1/30"
      + name       = "dept-squad-b-stg-iface0"
      + project    = "bon-transport-stg-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + vpn_tunnel = "dept-squad-b-stg-tun0"
    }

  # google_compute_router_interface.transport1 will be created
  + resource "google_compute_router_interface" "transport1" {
      + id         = (known after apply)
      + ip_range   = "169.254.33.5/30"
      + name       = "dept-squad-b-stg-iface1"
      + project    = "bon-transport-stg-07"
      + region     = (known after apply)
      + router     = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + vpn_tunnel = "dept-squad-b-stg-tun1"
    }

  # google_compute_router_peer.squad_transport0 will be created
  + resource "google_compute_router_peer" "squad_transport0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-b-stg-iface0"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-stg-iface0"
      + peer_asn                  = 64533
      + peer_ip_address           = "169.254.33.2"
      + project                   = "bon-dept-squad-b-stg-07"
      + region                    = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.squad_transport1 will be created
  + resource "google_compute_router_peer" "squad_transport1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "dept-squad-b-stg-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-transport-stg-iface1"
      + peer_asn                  = 64533
      + peer_ip_address           = "169.254.33.6"
      + project                   = "bon-dept-squad-b-stg-07"
      + region                    = (known after apply)
      + router                    = (known after apply)
    }

  # google_compute_router_peer.transport_squad0 will be created
  + resource "google_compute_router_peer" "transport_squad0" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-stg-iface0"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-b-stg-iface0"
      + peer_asn                  = 64513
      + peer_ip_address           = "169.254.33.1"
      + project                   = "bon-transport-stg-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
    }

  # google_compute_router_peer.transport_squad1 will be created
  + resource "google_compute_router_peer" "transport_squad1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "transport-stg-iface1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-dept-squad-b-stg-iface1"
      + peer_asn                  = 64513
      + peer_ip_address           = "169.254.33.5"
      + project                   = "bon-transport-stg-07"
      + region                    = (known after apply)
      + router                    = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
    }

  # google_compute_vpn_tunnel.squad0 will be created
  + resource "google_compute_vpn_tunnel" "squad0" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-stg-tun0"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + peer_ip                 = (known after apply)
      + project                 = "bon-dept-squad-b-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = (known after apply)
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.squad1 will be created
  + resource "google_compute_vpn_tunnel" "squad1" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "transport-stg-tun1"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + peer_ip                 = (known after apply)
      + project                 = "bon-dept-squad-b-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = (known after apply)
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = (known after apply)
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.transport0 will be created
  + resource "google_compute_vpn_tunnel" "transport0" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "dept-squad-b-stg-tun0"
      + peer_gcp_gateway        = (known after apply)
      + peer_ip                 = (known after apply)
      + project                 = "bon-transport-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + vpn_gateway_interface   = 0
    }

  # google_compute_vpn_tunnel.transport1 will be created
  + resource "google_compute_vpn_tunnel" "transport1" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = (known after apply)
      + name                    = "dept-squad-b-stg-tun1"
      + peer_gcp_gateway        = (known after apply)
      + peer_ip                 = (known after apply)
      + project                 = "bon-transport-stg-07"
      + region                  = (known after apply)
      + remote_traffic_selector = (known after apply)
      + router                  = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/routers/transport-stg"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-07/regions/us-central1/vpnGateways/transport-stg"
      + vpn_gateway_interface   = 0
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.



Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Workflow: `Plan Boniface GCP Org`, Action: `bonifaceltdterragrunt-github-actions3`, Working Directory: `.`, Workspace: `default`*
